Tekla.Structures.Model.Solid.SolidCreationTypeEnum
The creation type of the solid.

Tekla.Structures.Model.Solid.SolidCreationTypeEnum.RAW
The solid is created without any boolean operations.

Tekla.Structures.Model.Solid.SolidCreationTypeEnum.FITTED
The solid is created with fittings.

Tekla.Structures.Model.Solid.SolidCreationTypeEnum.NORMAL
The solid is created including all cutting and fitting operations.

Tekla.Structures.Model.Solid.SolidCreationTypeEnum.HIGH_ACCURACY
The solid is created as normal with an exact profile cross section.

Tekla.Structures.Model.Solid.SolidCreationTypeEnum.PLANECUTTED
The solid is created with fittings and cut planes.

Tekla.Structures.Model.Solid.SolidCreationTypeEnum.NORMAL_WITHOUT_EDGECHAMFERS
The solid is created including all cutting and fitting operations without edge chamfers.

Tekla.Structures.Model.Solid.SolidCreationTypeEnum.NORMAL_WITHOUT_WELDPREPS
The solid is created including all cutting and fitting operations without weld prepping.